In [1]:
import pandas as pd
import seaborn as sns
import matplotlib.pyplot as plt

In [2]:
df = pd.read_csv(r"D:\SQL\csv_files_python\5_optimal_skills.csv")

In [3]:
df

    skill_id      skills  demand_count  avg_salary
0          8          go            27      115320
1         97      hadoop            22      113193
2         80   snowflake            37      112948
3         74       azure            34      111225
4         76         aws            32      108317
5         79      oracle            37      104534
6        185      looker            49      103795
7          1      python           236      101397
8          5           r           148      100499
9        182     tableau           230       99288
10       186         sas            63       98902
11         7         sas            63       98902
12        61  sql server            35       97786
13       183    power bi           110       97431
14         0         sql           398       97237
15       215        flow            28       97200
16       199        spss            24       92170
17        22         vba            24       88783
18       196  powerpoint            58       88701
19       181       excel           256       87288